#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

# Completions

zsh-users/zsh-completions path:src kind:fpath
mattmc3/ez-compinit
docker/cli path:contrib/completion/zsh kind:fpath
go-task/task path:completion/zsh kind:fpath
sudosubin/zsh-github-cli
zsh-users/zsh-completions kind:fpath path:src
aloxaf/fzf-tab  # Remove if you don't use fzf

# Completion styles
belak/zsh-utils path:completion/functions kind:autoload post:compstyle_zshzoo_setup

# Keybindings
belak/zsh-utils path:editor

# History
belak/zsh-utils path:history

# Prompt
romkatv/powerlevel10k

# Utilities
zshzoo/macos conditional:is-macos
belak/zsh-utils path:utility
romkatv/zsh-bench kind:path

https://github.com/peterhurford/up.zsh
rummik/zsh-tailf
mattmc3/zman
agkozak/zsh-z
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/history

https://github.com/junegunn/fzf-git.sh

 Other Fish-like features
zdharma-continuum/fast-syntax-highlighting  # Syntax highlighting
zsh-users/zsh-autosuggestions               # Auto-suggestions
zsh-users/zsh-history-substring-search      # Up/Down to search history
